---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
source: html/9bb95365-04a3-6c28-5f72-477facd80cbc.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData

Represents the MEP analytical model data attached to individual element.

## Syntax (C#)
```csharp
public class MEPAnalyticalModelData : IDisposable
```

## Remarks
The MEP analytical model is composed of generic analytical segments and nodes.
 Each Revit element may have one or more analytical segments. Connected together,
 these data form a network that is used in the flow and pressure drop calculation.